{
  "example_door_with_code": {
    "description": "Перед тобой массивная металлическая дверь с кодовым замком. На панели мигают три пустых ячейки. Ты вспоминаешь, что где-то видел цифры...",
    "items_to_add": [],
    "actions": [
      {
        "target": "nazhat_147",
        "text": "Ввести код 147",
        "required_items": [
          "digit_1",
          "digit_4",
          "digit_7"
        ]
      },
      {
        "target": "vstat_s_krovati",
        "text": "Вернуться назад",
        "required_items": []
      }
    ],
    "is_win": false,
    "is_loss": false
  },
  "example_loss": {
    "description": "Ты делаешь неверный шаг. Сигнализация взрывается оглушительным воем. Сотрудники в зеленых жилетках окружают тебя со всех сторон...",
    "items_to_add": [],
    "actions": [
      {
        "target": "start",
        "text": "Попробовать снова",
        "required_items": []
      }
    ],
    "is_win": false,
    "is_loss": true
  },
  "example_win": {
    "description": "Ты вводишь код 1-4-7. Замок щелкает, дверь медленно открывается. За ней - яркий свет улицы. Ты свободен!",
    "items_to_add": [],
    "actions": [
      {
        "target": "start",
        "text": "Начать заново",
        "required_items": []
      }
    ],
    "is_win": true,
    "is_loss": false
  },
  "idti_k_vyhodu": {
    "description": "",
    "items_to_add": [],
    "actions": [],
    "is_win": false,
    "is_loss": false
  },
  "idti_na_zvuk_skanera": {
    "description": "Ты выползаешь из под пыльных деревянных ящиков, в которых одиноко лежат пара сгнивших картофелин. Прямо перед глазами спиной к тебе молча стоит \"Сотрудник\" в зелёной жилетке, его сканер всё так же ритмично пищит над пустыми коробками. Ты понимаешь, что если сделаешь хоть одно лишнее движение, то станешь очередным товаром в его лучах. Пот стекает с лица и капает на пол.",
    "items_to_add": [],
    "actions": [],
    "is_win": false,
    "is_loss": false
  },
  "kljuch": {
    "description": "",
    "items_to_add": [],
    "actions": [],
    "is_win": false,
    "is_loss": false
  },
  "krichat": {
    "description": "Ничего не происходит. Ты кричишь, словно в пустоту. Но все таки этот мощный выброс энергии помогает тебе сконцентрироваться на своей главной миссии - побеге из загадочного места.",
    "items_to_add": [],
    "actions": [
      {
        "target": "vstat_s_krovati",
        "text": "Встать с кровати",
        "required_items": []
      }
    ],
    "is_win": false,
    "is_loss": false
  },
  "marker": {
    "description": "",
    "items_to_add": [],
    "actions": [],
    "is_win": false,
    "is_loss": false
  },
  "naschupat_butylku_naugad": {
    "description": "Пальцы смыкаются на холодном горлышке. Ты тянешь бутылку на себя, но она оказывается зажата между другими. Один резкий рывок - и равновесие нарушено. Весь стеллаж, словно живой организм, содрогается. С верхней полки на тебя обрушивается лавина тяжелого стекла. Ты даже не успеваешь вскрикнуть. Один из осколков стекла перерезает сонную артерию на шее, быстрее, чем ты осознаешь боль. Последнее, что ты слышал - торжествующее пиканье сканера на кассе. Ты проиграл.",
    "items_to_add": [],
    "actions": [
      {
        "target": "start",
        "text": "Попробовать еще раз",
        "required_items": []
      }
    ],
    "is_win": false,
    "is_loss": true
  },
  "nazhat_147": {
    "description": "",
    "items_to_add": [],
    "actions": [],
    "is_win": false,
    "is_loss": false
  },
  "obyskat_holodilniki": {
    "description": "",
    "items_to_add": [],
    "actions": [],
    "is_win": false,
    "is_loss": false
  },
  "ogljanutsja_na_krovat": {
    "description": "Перед тем как сделать шаг в торговый зал, ты инстинктивно оборачиваешься. Твое сердце в нокауте. На кровати, где мгновение назад было пусто, теперь лежит человек. Он спит, разметавшись по простыне, а его лицо... это твоё лицо. В панике ты захлопываешь дверь подсобки. Щелчок, ты понимаешь, что замок самозахлопывающийся. Пути назад нет, ты один в огромном магазине.",
    "items_to_add": [],
    "actions": [
      {
        "target": "vyjti_v_torgovyj_zal",
        "text": "Выйти в торговый зал",
        "required_items": []
      }
    ],
    "is_win": false,
    "is_loss": false
  },
  "otkryt_dver_kljuchom": {
    "description": "Ключ входит в скважину как влитой. Ты поворачиваешь его, и сухой щелчок эхом отдаётся в пустой чёрной комнате. Дверь медленно открывается. За ней нет привычного подъезда или коридора, лишь бесконечный ряд стеллажей. Ты замираешь на пороге, осознавая, что всё это время находился в подсобке той самой \"Пятерочки\", чья вывеска только что светила тебе в окно.",
    "items_to_add": [],
    "actions": [
      {
        "target": "ogljanutsja_na_krovat",
        "text": "Оглянуться на кровать",
        "required_items": []
      }
    ],
    "is_win": false,
    "is_loss": false
  },
  "pojti_na_sklad": {
    "description": "Урчание в животе становится болезненным, перекрывая даже гул холодильников. Ты помнишь, что за овощным отделом всегда была тяжелая железная дверь, ведущая в зону приемки. Там, среди коробок и паллет, наверняка завалялась пара батончиков или хотя бы пачка сухариков.\nТы проскальзываешь мимо тележки с пододеяльником и упираешься в серую металлическую дверь. Она выглядит чужеродно - слишком массивной для обычного подсобного помещения. На уровне твоих глаз - старый механический замок с десятью кнопками, расположенными в два ряда. Кнопки засалены, а краска на них стерта временем. Чтобы открыть такую дверь, нужно одновременно нажать три цифры",
    "items_to_add": [],
    "actions": [
      {
        "target": "poprobovat_kombinatsiju_naugad",
        "text": "Попробовать комбинацию наугад",
        "required_items": []
      },
      {
        "target": "sprjatatsja_v_otdele_ovoschej",
        "text": "Искать подсказку в отделе овощей",
        "required_items": []
      },
      {
        "target": "proverit_otdel_molochnoj_produktsii",
        "text": "Искать подсказку в молочном отделе",
        "required_items": []
      },
      {
        "target": "popytatsja_najti_vypivku_v_otdele_alkogolja",
        "text": "Искать подсказку среди пустых бутылок",
        "required_items": []
      },
      {
        "target": "nazhat_147",
        "text": "Нажать 147",
        "required_items": []
      }
    ],
    "is_win": false,
    "is_loss": false
  },
  "poprobovat_kombinatsiju_naugad": {
    "description": "",
    "items_to_add": [],
    "actions": [],
    "is_win": false,
    "is_loss": false
  },
  "poprobovat_otkryt_dver": {
    "description": "Ты дергаешь за ручку, но массивная деревянная дверь не поддается. Твои пальцы ощущают холод замочной скважины. Без ключа отсюда не выбраться.",
    "items_to_add": [],
    "actions": [
      {
        "target": "poprobovat_otkryt_okno",
        "text": "Осмотреться в поисках ключа у окна",
        "required_items": []
      },
      {
        "target": "otkryt_dver_kljuchom",
        "text": "Вставить ключ в скважину и повернуть",
        "required_items": ["kljuch"]
      }
    ],
    "is_win": false,
    "is_loss": false
  },
  "poprobovat_otkryt_okno": {
    "description": "Ты поворачиваешь тугую ручку пластикового окна, в комнату врывается озоновый запах вечернего города. Твой взгляд опускается на подоконник, где лежит старый металлический ключ, покрытый налётом ржавчины. Ты протягиваешь руку, забираешь его и чувствуешь холод металла ладонью.",
    "items_to_add": [
      {
        "id": "kljuch",
        "name": "Ключ"
      }
    ],
    "actions": [
      {
        "target": "vstat_s_krovati",
        "text": "Вернуться к двери",
        "required_items": []
      }
    ],
    "is_win": false,
    "is_loss": false
  },
  "popytatsja_najti_vykljuchatel": {
    "description": "В горле саднит от сухости, словно ты наглотался пыли. Ты ведешь ладонями по стене - пальцы цепляются за острые сколы голого бетона и глубокие трещины. В голове пульсирует единственная мысль: найти выключатель.\nНаконец под пальцами оказывается холодный пластик. Щелчок... Пространство взрывается белизной. Ты невольно зажмуриваешься, до боли в глазах, пока зрачки пытаются привыкнуть к этой хирургической яркости.",
    "items_to_add": [],
    "actions": [
      {
        "target": "vstat_s_krovati",
        "text": "Встать с кровати",
        "required_items": []
      },
      {
        "target": "krichat",
        "text": "Кричать \"ААААА, ГДЕ Я???\"",
        "required_items": []
      }
    ],
    "is_win": false,
    "is_loss": false
  },
  "popytatsja_najti_vypivku_v_otdele_alkogolja": {
    "description": "Ты заходишь вглубь рядов, где тускло поблескивает стекло. Здесь царит глухая темнота, пахнет пылью и застоявшимся спиртом. Ты вытягиваешь руки перед собой, боясь наткнуться на острые углы стеллажей. Твои пальцы касаются холодных горлышек, но ты не видишь ни содержимого, ни этикеток. Ты проводишь пальцем по одной из бутылок. Кто-то специально наклеил сюда кусок наждачной бумаги, вырезанный в форме цифры 7. От неожиданности ты резко убираешь руку. Бутылка падает. Мелкая стеклянная крошка впивается в подушечку пальца, оставляя царапину. В тишине отдела слышно, как где-то в глубине стеллажей что-то тихо булькнуло в ответ на твое движение.",
    "items_to_add": [],
    "actions": [
      {
        "target": "vyjti_v_torgovyj_zal",
        "text": "Вернуться в зал",
        "required_items": []
      },
      {
        "target": "naschupat_butylku_naugad",
        "text": "Нащупать бутылку наугад",
        "required_items": []
      },
      {
        "target": "vyjti_prjamo_k_sotrudniku",
        "text": "Выйти прямо к сотруднику",
        "required_items": []
      },
      {
        "target": "pojti_na_sklad",
        "text": "Пойти на склад",
        "required_items": []
      }
    ],
    "is_win": false,
    "is_loss": false
  },
  "popytatsja_snova_usnut": {
    "description": "Несколько десятков секунд тебе хватило, чтобы понять, что уснуть не получится. Ты слишком взбудоражен неожиданным местом пробуждения, к тому же, спал ты, видимо, довольно долго. Пора обдумывать дальнейшие действия.",
    "items_to_add": [],
    "actions": [
      {
        "target": "popytatsja_najti_vykljuchatel",
        "text": "Попытаться найти выключатель",
        "required_items": []
      },
      {
        "target": "vstat_s_krovati_i_osmotretsja",
        "text": "Встать с кровати и осмотреться",
        "required_items": []
      },
      {
        "target": "tschatelnee_vsmotretsja_v_okno",
        "text": "Тщательнее всмотреться в окно",
        "required_items": []
      }
    ],
    "is_win": false,
    "is_loss": false
  },
  "posmotret_na_svetofor": {
    "description": "Вместо того, чтобы начать принимать хоть какие-то действия, ты смотришь на светофор. Ты ощущаешь себя полным идиотом, но не можешь оторваться. Постепенно ты замечаешь, что твое тело стало тяжелым. Твое сознание гаснет... Теперь ты - четвертая машина в этом ряду, застывшая на вечном красном. Конец.",
    "items_to_add": [],
    "actions": [],
    "is_win": false,
    "is_loss": false
  },
  "proverit_otdel_molochnoj_produktsii": {
    "description": "Чем ближе ты подходишь к рядам с молочкой, тем сильнее зубы выбивают дробь. Здесь не просто прохладно, здесь мертвый арктический холод. Вдоль открытых холодильных камер стелется густой белый пар, накрывающий твои ноги по щиколотку. Ты проводишь рукой по полкам. Вместо привычных бутылок молока здесь стоят белые пакеты без надписей. На ощупь они ледяные и твердые, как камень. Ты приглядываешься к одному из них, на месте срока годности выбит таймер, не просто таймер, его цифры меняются у тебя на глазах в меньшую сторону. Обратный отсчет. Тебе осталось чуть меньше 10 минут до чего-бы то ни было, но явно чего-то ужасного. нужно срочно убегать из этого проклятого места. В конце ряда ты замечаешь на стене тяжелый серый ящик с надписью \"Главный распределительный щит\".",
    "items_to_add": [],
    "actions": [],
    "is_win": false,
    "is_loss": false
  },
  "sprjatatsja_v_otdele_ovoschej": {
    "description": "Ты ныряешь за пустые деревянные ящики, где когда-то лежали овощи. От них исходит сладковатый запах гнили. Надеясь найти что-нибудь полезное ты протягиваешь руку в ящик и начинаешь шарить, спустя некоторое время твоя рука нащупывает маленький металлический предмет, ты поднимаешь его и всматриваешься - это монета номиналом 1 рубль. В обычном то магазине за 1 рубль ничего не купишь, а в этом и подавно, ты со злостью швыряешь монетку на кафельный пол. Звук кажется оглушительным, пиканье сканера становится громче. Сквозь дырки в ящиках ты видишь, как по соседнему ряду медленно проезжает тележка. Она двигается сама по себе, в ней лежит только один предмет - твой мокрый от пота пододеяльник... Тебя пронизывает дрожь. В этом магазине есть еще кто-то... Ты понимаешь, что нужно срочно убегать из отдела овощей",
    "items_to_add": [],
    "actions": [
      {
        "target": "vyjti_v_torgovyj_zal",
        "text": "Вернуться обратно",
        "required_items": []
      },
      {
        "target": "vzjat_marker",
        "text": "Взять маркер из тележки",
        "required_items": []
      },
      {
        "target": "idti_na_zvuk_skanera",
        "text": "Выползти из-за ящиков прямо у касс",
        "required_items": []
      }
    ],
    "is_win": false,
    "is_loss": false
  },
  "start": {
    "description": "Ты просыпаешься, под головой лежит подушка, насквозь пропитанная липким потом. В окне мерцают автомобильные фары и неоновые вывески ночного города. Ты видишь горящую вывеску закрытого супермаркета \"Пятерочка\", три одинокие машины встали на красный свет светофора. Улицы мертвы - ни одного пешехода, лишь асфальт",
    "items_to_add": [],
    "actions": [
      {
        "target": "popytatsja_najti_vykljuchatel",
        "text": "Попытаться найти выключатель",
        "required_items": []
      },
      {
        "target": "vstat_s_krovati_i_osmotretsja",
        "text": "Встать с кровати и осмотреться",
        "required_items": []
      },
      {
        "target": "tschatelnee_vsmotretsja_v_okno",
        "text": "Тщательнее всмотреться в окно",
        "required_items": []
      },
      {
        "target": "popytatsja_snova_usnut",
        "text": "Попытаться снова уснуть",
        "required_items": []
      }
    ],
    "is_win": false,
    "is_loss": false
  },
  "tschatelnee_vsmotretsja_v_okno": {
    "description": "Ты всматриваешься в пустые улицы, отчаянно пытаясь выудить из памяти хотя бы один знакомый изгиб дороги или вывеску. Разум лихорадочно перебирает воспоминания о сотнях прошлых прогулок, но тщетно: перед глазами лишь безликие хрущевки, которыми усеяна вся страна. Ты даже не можешь с уверенностью сказать, твой ли это город. Мысли в голове скрежещут, словно несмазанные механизмы, пытаясь зацепиться за логику.\nТочно, машины! Номера подскажут регион.\nТы резко переводишь взгляд на автомобили, замершие перед светофором в странном, покорном ожидании. Черт... Номера не разобрать. Машины выстроены в ряд строго параллельно окну, скрывая от тебя заветные цифры. Последняя надежда определить координаты рассыпается в прах.",
    "items_to_add": [],
    "actions": [
      {
        "target": "posmotret_na_svetofor",
        "text": "Посмотреть на светофор",
        "required_items": []
      },
      {
        "target": "popytatsja_najti_vykljuchatel",
        "text": "Попытаться найти выключатель",
        "required_items": []
      }
    ],
    "is_win": false,
    "is_loss": false
  },
  "vkljuchit_svet": {
    "description": "Ты поднимаешь рубильник. Лампы в магазине один за одним включаются, освещая пустые ряды стерильным белым светом. Сотрудник в зеленом жилете, стоящий спиной к тебе, замирает. Луч его сканера медленно сканирует пространство перед кассами. Центральный проход завален тележками и коробками, незаметно пройти не получится. Если пойдешь через отдел алкоголя - попадешь прямо под луч. Тебе нужно где-то спрятаться.\nТвои глаза слезятся от резкого света. Ты переводишь взгляд на щиток, рука все еще лежит на рычаге. Теперь, когда лампа над твоей головой горит в полную силу, ты замечаешь: прямо на металлической дверце щитка, там, где ты только что шарил в темноте, проступила жирная, выжженная кислотой или нацарапанная чем-то острым цифра 4. Она находится ровно под тем местом, куда встал рычаг в положении «ВКЛ».",
    "items_to_add": [],
    "actions": [
      {
        "target": "sprjatatsja_v_otdele_ovoschej",
        "text": "Пробраться к выходу через отдел овощей",
        "required_items": []
      },
      {
        "target": "popytatsja_najti_vypivku_v_otdele_alkogolja",
        "text": "Пойти через отдел алкоголя",
        "required_items": []
      },
      {
        "target": "pojti_na_sklad",
        "text": "Пойти на склад",
        "required_items": []
      }
    ],
    "is_win": false,
    "is_loss": false
  },
  "vstat_s_krovati": {
    "description": "Ты медленно встаешь с кровати, ноги невыносимо болят, в глазах темнеет на пару секунд. Ты осматриваешься и видишь деревянную дверь напротив окна.",
    "items_to_add": [],
    "actions": [
      {
        "target": "poprobovat_otkryt_dver",
        "text": "Попробовать открыть дверь",
        "required_items": []
      },
      {
        "target": "poprobovat_otkryt_okno",
        "text": "Попробовать открыть окно",
        "required_items": []
      }
    ],
    "is_win": false,
    "is_loss": false
  },
  "vstat_s_krovati_i_osmotretsja": {
    "description": "Ты встаешь, в комнате темно, как в гробу, даже горящая вывеска \"Пятерочки\" не помогает тебе увидеть окружающую обстановку. Ты, обдумывая дальнейшие действия, решаешь не рисковать и вернуться на кровать.",
    "items_to_add": [],
    "actions": [
      {
        "target": "start",
        "text": "Вернуться на кровать",
        "required_items": []
      }
    ],
    "is_win": false,
    "is_loss": false
  },
  "vyjti_prjamo_k_sotrudniku": {
    "description": "",
    "items_to_add": [],
    "actions": [],
    "is_win": false,
    "is_loss": false
  },
  "vyjti_v_torgovyj_zal": {
    "description": "Холодный кафель обжигает твои босые ноги. Ряды стеллажей кажутся бесконечными, полки абсолютно пусты. В магазине работает только дежурное освещение, пол залит чем-то неприятным и склизким. Тишина нарушается гулом холодильников и ритмичным пиканьем сканера штрих-кодов в районе кассы. Нужно включить свет.",
    "items_to_add": [],
    "actions": [
      {
        "target": "sprjatatsja_v_otdele_ovoschej",
        "text": "Спрятаться в отделе овощей",
        "required_items": []
      },
      {
        "target": "popytatsja_najti_vypivku_v_otdele_alkogolja",
        "text": "Попытаться найти выпивку в отделе алкоголя",
        "required_items": []
      },
      {
        "target": "proverit_otdel_molochnoj_produktsii",
        "text": "Проверить отдел молочной продукции",
        "required_items": []
      },
      {
        "target": "pojti_na_sklad",
        "text": "Пойти на склад",
        "required_items": []
      }
    ],
    "is_win": false,
    "is_loss": false
  },
  "vzjat_marker": {
    "description": "Ты медленно встаёшь и берешь маркер из тележки. Лишним не будет, кто знает, когда пригодятся твои навыки каллиграфии.",
    "items_to_add": [
      {
        "id": "marker",
        "name": "Маркер"
      }
    ],
    "actions": [
      {
        "target": "idti_na_zvuk_skanera",
        "text": "Выползти из-за ящиков прямо у касс",
        "required_items": []
      }
    ],
    "is_win": false,
    "is_loss": false
  }
}